;----------------------- Тестирование вентиляторов ---------------------
;-----------------------------------------------------------------------

;============================== Параметры ==============================
;-----------------------------------------------------------------------

var fan_number=4              ; Указать номер вентилятора для команды M950

var freq_min=20               ; Указать начальную частоту ШИМ, Гц
var freq_max=100              ; Указать конечную частоту ШИМ, Гц

var freq_step=10              ; Указать шаг для линейного увеличения частоты
                              ; Укажите 0, чтобы увеличение было нелинейным

var pause=3                   ; Указать длительность паузы между тестами

var model_fan_speed_1=0.10    ; Указать производительность вентилятора (от 0.0 до 1.0)
var model_fan_speed_2=0.20    ; Указать производительность вентилятора (от 0.0 до 1.0)
var model_fan_speed_3=0.30    ; Указать производительность вентилятора (от 0.0 до 1.0)

;-----------------------------------------------------------------------
;-----------------------------------------------------------------------
;=======================================================================
;=======================================================================

G4 S2                                                                  ; Пауза

var freq=var.freq_min
 
while var.freq <= var.freq_max
   echo "Частота ШИМ "^var.freq^" Гц"                                  ; Вывод частоты в консоль
   
   M950 F{var.fan_number} Q{var.freq}                                  ; Задать частоту ШИМ
   M106 P{var.fan_number} S{var.model_fan_speed_1}                     ; Включить вентилятор со скоростью 1
   G4 S{var.pause}                                                     ; Пауза
   M106 P{var.fan_number} S{var.model_fan_speed_2}                     ; Включить вентилятор со скоростью 2
   G4 S{var.pause}                                                     ; Пауза
   M106 P{var.fan_number} S{var.model_fan_speed_3}                     ; Включить вентилятор со скоростью 3
   G4 S{var.pause}                                                     ; Пауза
   
   M106 P{var.fan_number} S0                                           ; Выключить вентилятор
   G4 S{var.pause}                                                     ; Пауза
   
   if var.freq_step = 0
      set var.freq=var.freq*2                                          ; Нелинейное увеличение частоты
   else
      set var.freq=var.freq+var.freq_step                              ; Линейное увеличение частоты

if var.freq > var.freq_max
   echo "Частота ШИМ "^var.freq_max^" Гц"                              ; Вывод частоты ШИМ в консоль
   M950 F{var.fan_number} Q{var.freq_max}                              ; Задать максимальную частоту ШИМ
   M106 P{var.fan_number} S{var.model_fan_speed_1}                     ; Включить вентилятор со скоростью 1
   G4 S{var.pause}                                                     ; Пауза
   M106 P{var.fan_number} S{var.model_fan_speed_2}                     ; Включить вентилятор со скоростью 2
   G4 S{var.pause}                                                     ; Пауза
   M106 P{var.fan_number} S{var.model_fan_speed_3}                     ; Включить вентилятор со скоростью 3
   G4 S{var.pause}                                                     ; Пауза

; -------------------------- Завершающий код ---------------------------   

M106 P{var.fan_number} S0                                              ; Выключить вентилятор
